tutorials/compressible/acousticFoam/obliqueAirJet/case_init/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tinlet          293;

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;

boundaryField
{
    inlet
    {
        type            fixedValue;
	value	        uniform $Tinlet;
    }
    "(window|fixedWall)"
    {
	type		zeroGradient;
    }
    box
    {
        type            inletOutlet;
        inletValue      uniform $Tinlet;
        value           uniform $Tinlet;
    }
}

// ************************************************************************* //
