tutorials/compressible/acousticFoam/obliqueAirJet/case_init/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(
    {
        // Name of new patch
        name inlet;

        // Dictionary to construct new patch from
        patchInfo
        {
            type patch;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom set;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        //patches (periodic1);

        // If constructFrom = set : name of faceSet
        set f0;
    }
    /*
    {
        // Name of new patch
        name flowInlet;

        // Dictionary to construct new patch from
        patchInfo
        {
            type path;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom set;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        //patches (periodic1);

        // If constructFrom = set : name of faceSet
        set f1;
    }
    
    {
        // Name of new patch
        name flowOutlet;

        // Dictionary to construct new patch from
        patchInfo
        {
            type path;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom set;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        //patches (periodic1);

        // If constructFrom = set : name of faceSet
        set f2;
    }
    */
    
//     {
//         // Name of new patch
//         name bottom;
// 
//         // Dictionary to construct new patch from
//         patchInfo
//         {
//             type wall;
//         }
// 
//         // How to construct: either from 'patches' or 'set'
//         constructFrom patches;
// 
//         // If constructFrom = patches : names of patches. Wildcards allowed.
//         patches (inlet);
//     }


);

// ************************************************************************* //
